# HDDT Quakers and introduction #

In [5]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import csv

In [10]:
quaker_table = pd.read_csv ('vw_1_religion_202107121852.csv')
quaker_names = pd.read_csv ('vw_1_quakers_202107121852.csv')
quaker_relationships = pd.read_csv ('vw_5_person1_person2_202107121948.csv')
quaker_ceda = pd.read_csv ('vw_4_ceda_membership_quakers_202107121945.csv')

In [11]:
quaker_table

,id,family_name,first_names,id:1,religion,confirmed,notes
0,2233,Wood,William Spicer,1,Quaker,0,Multiple possibilities
1,2211,Wilson,William,1,Quaker,0,Multiple possibilities
2,2208,Wilson,James,1,Quaker,0,Multiple possibilities
3,2108,Wakefield,E T,1,Quaker,1,"Edward T. Wakefield (1821-1896), of Portadown,..."
4,1744,Ross,John,1,Quaker,0,"Possibly John Ross (1798-1863), of Chatteris, ..."
...,...,...,...,...,...,...,...
588,2876,Wilson,Joshua,1,Quaker,1,"Joshua Wilson (1806-1877), merchant, ship and ..."
589,2877,Woodhead,F,1,Quaker,1,"Firth Woodhead (1811-1874), grocer and tea dea..."
590,2878,Woolston,W,1,Quaker,1,"William Woolston (1817-1898), of Wellingborough"
591,2879,Wright,Francis,1,Quaker,1,"Francis Wright (1774-1850), tanner, chemist, a..."
592,2880,Wright,S W,1,Quaker,1,"Samuel Williams Wright (1811-1895), farmer and..."

In [12]:
quaker_names

,id,Name,gender_id,birth_year,death_year,data_source_id,religion_id
0,23,William Aldam,1.0,1813.0,1890.0,1,1
1,27,S Stafford Allen,1.0,1840.0,1870.0,1,1
2,80,Edward Backhouse,1.0,1808.0,1879.0,1,1
3,81,James (1) Backhouse,1.0,1794.0,1869.0,1,1
4,151,James Bell,1.0,1818.0,1872.0,1,1
...,...,...,...,...,...,...,...
588,2876,Joshua Wilson,NaN,NaN,NaN,3,1
589,2877,F Woodhead,NaN,NaN,NaN,3,1
590,2878,W Woolston,NaN,NaN,NaN,3,1
591,2879,Francis Wright,NaN,NaN,NaN,3,1
592,2880,S W Wright,NaN,NaN,NaN,3,1

In [13]:
quaker_relationships

                   Source            Target  relationship_type_id
0           William Aldam             x Fox                     1
1       William Jun Aldam             x Fox                     1
2     Frederick Alexander     R D Alexander                     1
3           G W Alexander     R D Alexander                     1
4         Henry Alexander     R D Alexander                     1
...                   ...               ...                   ...
2094    Alfred Waterhouse      R Waterhouse                     3
2095      Mary Waterhouse        Paul Bevan                     3
2096       Lucy Westcombe  Thomas Westcombe                     3
2097     Benjamin Wheeler    Samuel Wheeler                     3
2098       Charles Wilson     Joshua Wilson                     3

[2099 rows x 3 columns]

In [14]:
quaker_ceda

,person_id,Name,religion_id,religion_name,ceda_id,ceda_name,person_ceda_first_year,person_ceda_last_year
0,2233,William Spicer Wood,1,Quaker,2,APS,1864,1867
1,2233,William Spicer Wood,1,Quaker,4,ASL,1863,1871
2,2233,William Spicer Wood,1,Quaker,6,AI,1863,1871
3,2211,William Wilson,1,Quaker,2,APS,1838,1865
4,2211,William Wilson,1,Quaker,4,ASL,1865,1866
...,...,...,...,...,...,...,...,...
639,2876,Joshua Wilson,1,Quaker,2,APS,1860,1860
640,2877,F Woodhead,1,Quaker,2,APS,1861,1862
641,2878,W Woolston,1,Quaker,2,APS,1861,1861
642,2879,Francis Wright,1,Quaker,2,APS,1838,1838
643,2880,S W Wright,1,Quaker,2,APS,1861,1861